app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def index
    @line_items = LineItem.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 14 Dec 2014 11:54:43 UTC +00:00], ["updated_at", Sun, 14 Dec 2014 11:54:43 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Sun, 14 Dec 2014 11:54:43 UTC +00:00], ["product_id", 1], ["updated_at", Sun, 14 Dec 2014 11:54:43 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 2  [["quantity", 2], ["updated_at", Sun, 14 Dec 2014 13:30:23 UTC +00:00]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      session[:counter] = 0
      if @line_item.save

DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    @line_item.destroy

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
    def set_line_item
      @line_item = LineItem.find(params[:id])